app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices" WHERE NOT (pending_amount = 0.0)
---
      def index
        @status = params[:status]
        invoices = Invoice.all

INSERT INTO "invoices" ("brand_manager", "narration", "invoice_date", "amount", "customer_name", "created_at", "updated_at", "reference", "pending_amount") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
      def create
        @invoice = Invoice.new(invoice_params)
        @invoice.pending_amount = @invoice.amount
        @invoice.invoice_date = Date.today

        respond_to do |format|
          if @invoice.save

INSERT INTO "collections" ("amount", "reference", "collection_date", "invoice_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
      def update
        Collection.create(invoice_id: @invoice.id, reference: @invoice.reference, amount: params[:invoice][:collection_amount], collection_date: Date.today)

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def set_invoice
          @invoice = Invoice.find(params[:id])