app/models/invoice.rb

UPDATE "invoices" SET "pending_amount" = $1, "updated_at" = $2 WHERE "invoices"."id" = $3  [["pending_amount", 600.0], ["updated_at", "2020-05-14 12:07:22.713193"], ["id", 15]]
---
		def update_pending_amount
			self.update(pending_amount: (self.amount - self.total_collection_amount))